# 01. Importing Libraries

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os

# 02. Importing Dataframes orders_wrangled.csv and products.csv

In [2]:
# importing orders_wrangled.csv
path=r'/Users/parvinrahimi/Desktop/Data/Data Immersion/Achievement 4/TASK 3/06-2023 Instacart Basket Analysis 9.46.07 AM/01 Project Management'

In [3]:
df_prods = pd.read_csv(os.path.join(path, 'Original Data', '4.3_orders_products', 'products.csv'), index_col = False)

In [4]:
df_ords = pd.read_csv(os.path.join(path, 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# 03. Data Consistency

In [5]:
# Create a Dataframe
df_test = pd.DataFrame()

In [6]:
# Creat a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [7]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [8]:
# Check if dataframe contains mixed type columns 
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [9]:
# Change data to string 
df_test['mix'] = df_test['mix'].astype('str')

In [10]:
# Finding missing values in prods.csv
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [11]:
# finding exact missing values
df_nan = df_prods[df_prods['product_name'].isnull()==True]

In [12]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [13]:
# (Dont rund) code for replacing missing values with mean
df['column with missings'].fillna(mean value, inplace=True)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (929301580.py, line 2)

In [ ]:
#  (Dont rund) code for replacing missing values with median
df['column with missings'].fillna(median value, inplace=True)

In [ ]:
# finding number of rows
df_prods.shape

In [ ]:
#creating new subset and removing missing data
df_prods_clean=df_prods[df_prods['product_name'].isnull()==False]

In [ ]:
df_prods_clean.shape

In [ ]:
# looking for full duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [ ]:
df_dups

In [ ]:
# removing duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [ ]:
df_prods_clean_no_dups.shape

In [ ]:
# savingclean data
df_prods_clean_no_dups.to_csv(os.path.join(path,'Prepared Data','products_checked.csv' ))

# 04. Exercise 4.5

In [26]:
# Q2. consistency check df_ords
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,last_order_in_days
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## the dataframe Orders.csv seems to be consistent.

In [14]:
# Q3. Check if dataframe contains mixed type columns 
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

## there is no mixed column in dataframe df_ords

In [15]:
#Q5. Finding missing values in orders.csv
df_ords.isnull().sum()

Unnamed: 0                 0
order_id                   0
user_id                    0
eval_set                   0
order_number               0
orders_day_of_week         0
order_hour_of_day          0
last_order_in_days    206209
dtype: int64

In [16]:
# Rename the "unnamed" column to Row_Number
df_ords.rename(columns = {'Unnamed: 0' : 'Row_Number'}, inplace = True)

In [17]:
df_ords.head()

,Row_Number,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,last_order_in_days
0,0,2539329,1,prior,1,2,8,NaN
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0

In [18]:
# finding exact missing values in orders.csv
df_nan_ords = df_ords[df_ords['last_order_in_days'].isnull()==True]

In [19]:
df_nan_ords

,Row_Number,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,last_order_in_days
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3154581,206209,prior,1,3,11,NaN

# the missing data refers to customers who have only placed one order and thus counting the days between orders is redundant. However, this data is valuable to our study and should not be deleted.

In [20]:
# Q.7 looking for full duplicates
df_ords_dups = df_ords[df_ords.duplicated()]

In [21]:
df_ords_dups

Empty DataFrame
Columns: [Row_Number, order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, last_order_in_days]
Index: []

# there are no duplicates in orders.csv

In [22]:
# saving clean data
df_ords.to_csv(os.path.join(path,'Prepared Data','orders_checked.csv' ))